---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.GetRowHeightInPixels(System.Int32)
source: html/c115c7c5-1392-f7b7-b14f-994351f1a13c.htm
---
# Autodesk.Revit.DB.TableSectionData.GetRowHeightInPixels Method

This returns a row's height in logical pixels

## Syntax (C#)
```csharp
public int GetRowHeightInPixels(
	int nRow
)
```

## Parameters
- **nRow** (`System.Int32`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The given row number nRow is invalid.